clear all;
[x,z,u]=peaks;
u(1,1)
% A=[x(1,:),z(:,1)',u]
% for i=1:49
% find(A(i,1)==1|2|3|4)&&(A(i,2)==1|1.5|2))
% find(A(i,1)==1|2|3|4)&&(A(i,2)==1|1.5|2)
%     A(i,3)=[5.14,9.56,8.66,7.88,12.55,10.51,15,12.44,22.03,22.97,32.94,34.89];
% end
% end
% %  elseif x==1:4&z==[2.5,3];
% %      u=[5.14,9.56,8.66,10.24;12.55,10.51,15,24];
%  end
%      subplot(1,2,1);[c,h]=contour(x,z,u);clabel(c,h);title('二维等高线图');
%      subplot(1,2,2);[c,h]=contour3(x,z,u);clabel(c,h);title('三维等高线图');



%修改一个函数的某些xz点的u值，修改值为一个矩阵的对应元素没有做出来