%%
clear all;
Z=linspace(0,6,41);
R=linspace(-1,1,41);
[r,z]=meshgrid(R,Z);
u1=((35.27/76.95)*pi*exp(-76.95*(r./z).^2)).^0.5;% （射流速度场）
u2=((99.49/144.18)*z.*pi*exp(-144.18*(r./z).^2)).^(1/3); % （羽流速度场）
u=u1+u2;
subplot(2,2,1);surf(r,z,u1);title('点源叠加法计算的动量射流速度场曲面图');
subplot(2,2,2);surf(r,z,u);title('点源叠加法计算的浮射流速度场曲面图');
subplot(2,2,3);
hold on;
r=linspace(-1,1,41);u11=((35.27/76.95)*pi*exp(-76.95*(r./0.5).^2)).^0.5+((99.49/144.18)*0.5*pi*exp(-144.18*(r./0.5).^2)).^(1/3);
plot(r,u11,':');


r=linspace(-1,1,41);u22=((35.27/76.95)*pi*exp(-76.95*(r./1).^2)).^0.5+((99.49/144.18)*0.5*pi*exp(-144.18*(r./1).^2)).^(1/3);
plot(r,u22,'-.');

r=linspace(-1,1,41);u33=((35.27/76.95)*pi*exp(-76.95*(r./5.0).^2)).^0.5+((99.49/144.18)*0.5*pi*exp(-144.18*(r./5.0).^2)).^(1/3);
plot(r,u33,'--');

legend('z=0,5','z=1.0','z=5.0');title('点源叠加法计算的浮射流轴心速度');hold off
subplot(2,2,4);[r,z,u]=peaks;[c,h]=contour(r,z,u);clabel(c,h); title('二维等高线图')
